app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13')  ORDER BY release_date
---
    def index
      @all_ratings = ['G','PG','PG-13','R']
      @checked_ratings = params[:ratings]
      @sort_order = params[:sort_order]
      if not session.empty?
        read_session
      end

      if not @checked_ratings
        @checked_ratings = @all_ratings
      else
        @checked_ratings = @checked_ratings.keys
      end
      @movies = Movie.with_ratings(@checked_ratings)

      if @sort_order
        @movies = Movie.with_ratings(@checked_ratings).order @sort_order

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "SDFDFSSDS"], ["updated_at", "2022-02-26 01:55:17.397684"], ["id", 13]]
---
    def update
      @movie = Movie.find params[:id]
      @movie.update_attributes!(movie_params)